In [6]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
import seaborn as sns

In [7]:
x=pd.read_excel('/home/prasanth/Delhi .xlsx') #reading xlsx file using pandas library
x.head()

                 Date pm25
0                 NaT  NaN
1                 NaT  NaN
2 2018-04-20 00:00:00   92
3 2018-04-19 23:00:00   89
4 2018-04-19 22:00:00   75

In [8]:
x.drop([0,1],axis=0,inplace=True)

In [13]:
x = x.reindex()

In [29]:
x.head()

  pm25        date      time
0   92  2018-04-20  00:00:00
1   89  2018-04-19  23:00:00
2   75  2018-04-19  22:00:00
3   57  2018-04-19  21:00:00
4   57  2018-04-19  20:00:00

In [20]:
x['date'] = [d.date() for d in x['Date']]
x['time'] = [d.time() for d in x['Date']]

In [22]:
x.drop(['Date'], axis=1, inplace=True)

In [23]:
x.head()

  pm25        date      time
0   92  2018-04-20  00:00:00
1   89  2018-04-19  23:00:00
2   75  2018-04-19  22:00:00
3   57  2018-04-19  21:00:00
4   57  2018-04-19  20:00:00

In [24]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2374 entries, 0 to 2373
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pm25    2374 non-null   object
 1   date    2374 non-null   object
 2   time    2374 non-null   object
dtypes: object(3)
memory usage: 55.8+ KB

In [25]:
print(x.isnull().sum())

pm25    0
date    0
time    0
dtype: int64

In [26]:
x.describe()

        pm25        date      time
count   2374        2374      2374
unique   436         107        24
top        -  2018-04-02  00:00:00
freq      80          24       102

In [31]:
sns.distplot(x='date',y='pm25',data='x' )

TypeError: distplot() got an unexpected keyword argument 'y'